{
  "backend/main.mo": "Motoko canister exposing a validateCustomDomain method intended for publish-time validation.",
  "feature_evidence.json": "Feature evidence report mapping UI changes and WhatsApp updates to specific frontend files with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, including UI components, hooks, styling, and WhatsApp utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme rules for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.md": "Project documentation covering features, setup, development workflow, and deployment notes for the laundry calculator app.",
  "frontend/src/App.tsx": "Main React component combining the laundry calculator with custom domain validation UI and backend checks.",
  "frontend/src/components/LaundryPriceCalculator.tsx": "Interactive price calculator with item quantities, total calculation, customer info fields, validation, and WhatsApp order support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor, updating when identity changes.",
  "frontend/src/hooks/useCustomDomainValidation.ts": "Hook providing local and backend domain validation logic with rules for length, character set, and hyphen usage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login state, and AuthClient creation.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes and global typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/whatsapp.ts": "Utility functions to compose WhatsApp order messages, generate click‑to‑chat URLs, and open WhatsApp with prefilled order details.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Describes the project's current architecture, features, issues, and metadata for the ICP dapp scaffold."
}