{
  "kind": "build_request",
  "title": "Add Customer Name field to Laundry order flow and WhatsApp message",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a new \"Customer Name\" input field to the Laundry Price Calculator order flow UI, captured in component state and displayed alongside the existing contact number and pickup/delivery address fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Isme customer ka name add kro"
        ]
      },
      "acceptanceCriteria": [
        "When the Order Summary panel is opened, a \"Customer Name\" field is visible along with the existing \"Your Contact Number\" and \"Pickup/Delivery Address\" fields.",
        "The \"Customer Name\" field value is stored in React state and remains visible while the Order Summary panel is open.",
        "All labels/placeholders/help text added for the new field are in English and match the existing styling conventions used for the contact number and address fields (shadcn Input/Label)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Validate the new Customer Name field on the client and prevent sending a WhatsApp order unless Customer Name, Contact Number, and Pickup/Delivery Address are provided; show a clear English inline validation message for the Customer Name field when invalid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Isme customer ka name add kro"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Order on WhatsApp\" does not open WhatsApp when Customer Name is empty/whitespace, and an inline English error message is shown for the Customer Name field.",
        "Existing validation behavior for contact number and address remains in place and continues to block WhatsApp ordering when invalid.",
        "Once Customer Name, contact number, and address are all valid, the WhatsApp ordering action proceeds successfully."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Include the captured Customer Name in the prefilled WhatsApp message generated for the order, together with the existing customer contact number, address, line items, and grand total, while keeping the WhatsApp destination number as +917248903366.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Isme customer ka name add kro"
        ]
      },
      "acceptanceCriteria": [
        "The generated WhatsApp message contains a \"Name:\" line under the customer details section when Customer Name is provided.",
        "The message continues to include \"Contact:\" and \"Address:\" lines, all selected line items with quantities and line totals, and the \"Grand Total\" line.",
        "The WhatsApp click-to-chat URL still targets +917248903366 (no change to the destination number)."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed in SYSTEM_CONTEXT.frontend.immutablePaths must not be edited.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not add backend persistence or store customer details on-chain.",
    "Do not change item pricing, item list, or the existing custom domain validation feature."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}