{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Customer Name to laundry order flow and WhatsApp message",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add a Customer Name field to the Order Summary panel and store it in component state alongside contact number and address.",
      "acceptanceCriteria": [
        "When the Order Summary panel is opened, a \"Customer Name\" field is visible along with the existing \"Your Contact Number\" and \"Pickup/Delivery Address\" fields.",
        "The \"Customer Name\" field value is stored in React state and remains visible while the Order Summary panel is open.",
        "All labels/placeholders/help text added for the new field are in English and match the existing styling conventions used for the contact number and address fields (shadcn Input/Label)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LaundryPriceCalculator.tsx",
          "operation": "modify",
          "description": "Add React state for customerName and render a new \"Customer Name\" input in the Order Summary panel near the existing contact number and address fields. Use shadcn-ui Input and Label to match existing styling conventions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Client-validate Customer Name and block WhatsApp ordering until name, contact number, and address are all valid, showing an inline error for name.",
      "acceptanceCriteria": [
        "Clicking \"Order on WhatsApp\" does not open WhatsApp when Customer Name is empty/whitespace, and an inline English error message is shown for the Customer Name field.",
        "Existing validation behavior for contact number and address remains in place and continues to block WhatsApp ordering when invalid.",
        "Once Customer Name, contact number, and address are all valid, the WhatsApp ordering action proceeds successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LaundryPriceCalculator.tsx",
          "operation": "modify",
          "description": "Add customerNameError state and a validateCustomerName function (trim/whitespace check) that sets a clear English inline error message when invalid. Update the \"Order on WhatsApp\" click handler to validate customer name in addition to existing contact/address validation and prevent opening WhatsApp when any required field is invalid. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Include Customer Name in the generated WhatsApp message while keeping the destination number unchanged.",
      "acceptanceCriteria": [
        "The generated WhatsApp message contains a \"Name:\" line under the customer details section when Customer Name is provided.",
        "The message continues to include \"Contact:\" and \"Address:\" lines, all selected line items with quantities and line totals, and the \"Grand Total\" line.",
        "The WhatsApp click-to-chat URL still targets +917248903366 (no change to the destination number)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/whatsapp.ts",
          "operation": "modify",
          "description": "Extend WhatsApp message composition to accept an optional customerName and include a \"Name:\" line in the customer details section (alongside existing Contact and Address) when provided, while preserving the rest of the message format and URL generation behavior."
        },
        {
          "path": "frontend/src/components/LaundryPriceCalculator.tsx",
          "operation": "modify",
          "description": "Pass the captured customerName into the WhatsApp order utility when opening WhatsApp, ensuring the destination number remains +917248903366 and existing items/totals behavior is unchanged."
        }
      ]
    }
  ]
}